Autodesk.Revit.DB.Structure.RebarBendingDetailType.Create(Autodesk.Revit.DB.Document)
Creates a new RebarBendingDetailType object.
Document:
Document to which the new element should be added.
Returns:
The new RebarBendingDetailType object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsForHooksEnabled
Identifies if radial or diameter dimensions will be shown for hook fillets.
This property has a meaning only if Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsEnabled is set to true.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsForSegmentsEnabled
Identifies if radial or diameter dimensions will be shown for the bends between segments.
Radial or diameter dimesions for arc segments will be shown by default.
This property has a menaning only if Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsEnabled is set to true.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionType
Identifies what type of bend diameter dimensions will be shown (radial or diameter).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.DiameterDimensionTypeId
Identifies the Id of the diameter dimension type which is used to show dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.RadialDimensionTypeId
Identifies the Id of the radial dimension type which is used to show dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsEnabled
Identifies if any radial or diameter dimensions will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsMeasurementOptions
Identifies the measurement option for angular dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionTextPosition
Identifies the text position with respect to dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsForHooksEnabled
Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsOffset
Identifies the offset of the angular dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for angularDimensionsOffset must be between 0 and 30000 feet.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsDisplayOption
Identifies the angular dimensions display options.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionTypeId
Identifies the Id of the angular dimension type which is used to show dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsEnabled
Identifies if any angular dimensions will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.OrthogonalAndOverallDimesionsEnabled
Identifies if orthogonal and overall dimensions are displayed.
Remarks:
Orthogonal segment length dimensions are dimensions defining the slope of a bar segment.
Overall dimensions are dimensions that spans over multiple segments.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsForHooksEnabled
Identifies if segment length dimensions for hooks will be shown or not.
If this property is true, the Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsOffset
Identifies the offset of the segment length dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for segmentLengthDimensionsOffset must be between 0 and 30000 feet.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionTextPosition
Identifies the text position with respect to dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthsForArcsDisplayOption
Identifies if the arc segment lengths are represented using dimensions or just as text.
Only RebarShapes whose definition is RebarShapeDefinitionByArc are considered that have arc segments.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthsDisplayOption
Identifies if the segment lengths are represented using dimensions or just as text.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionTypeId
Identifies the Id of the linear dimension type which is used to show segments length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsEnabled
Identifies if any segment length dimensions will be shown or not.
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.DetailLevel
Identifies the level of detail in which the Bending Detail will be represented.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.MultipleValuesIndicatorOption
Identifies the option of how multiple values will be represented.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.RepresentaionOf3DShapes
Identifies how the Bending Detail will represent the 3D shapes.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentsRepresentation
Identifies how the bending detail will represent the segments of the bar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetailType
Type for rebar bending detail elements.
Since:
2024